In [1]:
import sqlite3
import pandas as pd
import numpy as np

In [2]:
#conn = sqlite3.connect('test_database')

In [3]:
#importing the dataset.
url = (r"https://raw.github.com/pandas-dev/pandas/main/pandas/tests/io/data/csv/tips.csv")

tips = sqlite3.connect('url')
tips = pd.read_csv(url)
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

#With pandas, column selection is done by passing a list of column names to your DataFrame:

In [4]:
da1=tips[["total_bill", "tip", "smoker", "time"]].head(3)
da1

   total_bill   tip smoker    time
0       16.99  1.01     No  Dinner
1       10.34  1.66     No  Dinner
2       21.01  3.50     No  Dinner

 #With pandas, you can use the DataFrame.assign() method of a DataFrame to append a new column:

In [5]:
tips_new=tips.assign(tip_rate=tips["tip"] / tips["total_bill"])
tips_new.head(3)

   total_bill   tip     sex smoker  day    time  size  tip_rate
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587

#DataFrames can be filtered in multiple ways; the most intuitive of which is using boolean indexing.

In [6]:
total_billMoreThan10 = tips[tips['total_bill']>10]
total_billMoreThan10.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [7]:
#The above statement is simply passing a Series of True/False objects to the DataFrame, returning all rows with True.

In [8]:
is_dinner = tips["time"] == "Dinner"
is_dinner.value_counts()

True     176
False     68
Name: time, dtype: int64

In [9]:
# conditions and use of and or
tips_dinner=tips[(tips["time"] == "Dinner") & (tips["tip"] > 5.00)]
tips_dinner.head(3)

    total_bill   tip   sex smoker  day    time  size
23       39.42  7.58  Male     No  Sat  Dinner     4
44       30.40  5.60  Male     No  Sun  Dinner     4
47       32.40  6.00  Male     No  Sun  Dinner     4

In [10]:
from pandas import DataFrame
d1 = pd.DataFrame(np.arange(16).reshape(4,4),columns=[1,2,3,4], index=[1,2,3,4])
d1#quick reminder on creating a df using range.

    1   2   3   4
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [12]:
# using groupby in sql
data_data=tips.groupby('sex').size()
data_data

sex
Female     87
Male      157
dtype: int64

In [13]:
##we could have applied the count() method to an individual column:

In [15]:
totalBill=tips.groupby("sex")["total_bill"].count()
totalBill

sex
Female     87
Male      157
Name: total_bill, dtype: int64

In [16]:
## variable counts grouped by sex.
ColumnTotalsBySex = tips.groupby("sex").count()
ColumnTotalsBySex

        total_bill  tip  smoker  day  time  size
sex
Female          87   87      87   87    87    87
Male           157  157     157  157   157   157